<h2>DevServer</h2>

<h3>Setup</h3>
<p>
Das DevServer ZIP-Paket kann <a href="downloads.jsp">hier</a> heruntergeladen werden. Das Paket kann in ein beliebiges Verzeichnis extrahiert werden und muss anschlie&szlig;end in die <code>PATH</code>-Umgebungsvariable aufgenommen werden.
</p>
<p class="info">Der DevServer enth&auml;lt bereits die TwoSpot-Tools. Falls die
    TwoSpot-Tools bereits installiert sind m&uuml;ssen sie aus der <code>PATH</code>-Variable
    entfernt werden. In der <code>PATH</code>-Variabel d&uuml;rfen nicht gleichzeitig der DevServer
    und die TowSpot-Tools registriert sein!</p>

<h3>Konfiguration</h3>
<p>
Bevor der DevServer gestartet werden kann, m&uuml;ssen einige wenige Konfigurationseinstellungen
vorgenommen werden. Diese betreffen im Wesentlichen das Scratch-Verzeichnis.
Dieses wird vom DevServer f&uuml;r tempor&auml;re Dateien genutzt. Zum Beispiel
werden die Servlets f&uuml;r JSP-Dateien im Scratch-Verzeichnis gespeichert.
</p>

<p>
Die Konfigurationseinstellungen befinden sich in der <code>/conf/appserver/etc/appServer.properties</code>-Datei. Der anzupassende Schl&uuml;ssel f&uuml;r das Scratch-Verzeichnis lautet <code>appServer.scratchdir</code> (Zeile 9). Das folgende Beispiel zeigt eine korrekt konfigurierte <code>appServer.properties</code>-Datei mit dem Scratch-Verzeichnis <code>C:/temp/scratch</code>.
</p>

<p>
<b>Das Scratch-Verzeichnis muss bereits existieren! Es wird nicht vom DevServer erstellt!</b>
</p>

<pre class="prettyprint">
#### Server Options ###
# Mode in which the AppServer is running (DEVELOPMENT, SERVER)
appServer.mode=DEVELOPMENT

# Defines the working directory in which the extracted application directores reside
appserver.workDir=

# !!! Defines the scratch dir wich is used by the JSP-Compiler !!!
appServer.scratchdir=C:/temp/scratch

### Security options ###
# Request-Time which is detected as a DOS-attack (in ms)
appServer.security.DOSPrevention.time=40000
</pre>

<h3>Starten</h3>
<p>Der Start des DevServers erfolgt &uuml;ber das <code>twospot.py</code> Tools-Script,
    das sich im Root-Verzeichnis vom DevServer befindet. Befindet sich das DevServer-Verzeichnis
    in der <code>PATH</code>-Umgebungsvariable kann das Script direkt &uuml;ber die Konsole gestartet
    werden. Das Script muss in dem Anwendungs-Verzeichnis gestartet werden. Im
    Beispiel befindet sich die Anwendung <b>gogo</b> im
    Verzeichnis <code>/home/alf/dev/gogo</code>.
    Der DevServer wird dann wie folgenderma&szlig;en gestartet: 
</p>

<pre class="prettypring">
home/alf/dev/gogo> twospot.py --runServer
</pre>

<p>
Nach dem Start ist der DevServer und die Anwendung auf dem Port <b>8080</b> erreichbar. Die Starseite der gogo-Anwendung ist z.B. &uuml;ber die http-Adresse <code>http://localhost:8080/</code> erreichbar.
</p>

<h3>Unterschiede zur Produktionsumgebung</h3>

<h4>Security</h4>
<p>
In der Produktionsumgebung aktiviert der AppServer die Java Sicherheitsmechnismen. Die Anwendung wird somit in einer Sandbox ausgef&uuml;hrt. Grunds&auml;tzlich kann die Anwendung in keiner Form auf Funktionen des Betriebssystems zur&uuml;ckgreifen. Es ist also z.B. nicht m&ouml;glich mit Dateien zu arbeiten.
</p>

<h4>Datenbank</h4>
<p>
Leider ist es nicht m&ouml;glich die HBase-Datenbank im DevServer auszuf&uuml;hren.
Aus diesem Grund verwendet der DevServer die <a href="http://www.h2database.com">H2-Datenbank</a>.
Der Zugriff auf die Datenbank erfolgt analog zur Produktionsumgebung &uuml;ber
JDO. Bei der H2-Datenbank handelt es sich um eine typische relationale Datenbank
mit einem wesentlich gr&ouml;&szlig;eren Funktionsumfang als HBase. Aus diesem
Grund sollten nur die elementare JDO-Funktionalit&auml;t verwendet werden. Eine genauere
Beschreibung des Datenbankzugriffes ist <a href="hbase.jsp">hier</a> zu
finden. F&uuml;r die Anwendung ist die zugrundeliegende Datenbank aufgrund des
Einsatzes von JDO weitgehend transparent.
</p>

<h4>UserService</h4>
<p>
Die TwoSpot-Plattform stellt einen zentralen Benutzerservice mit einer einfachen
    API zur Verf&uuml;gung. Der DevServer enth&auml;lt eine Mock-Implementierung
    der UserService-API. Die Mock-Implementierung simuliert den Benutzerservice,
    enth&auml;lt aber keine Funktionen zur Authentifizierung. Dar&uuml;ber hinaus
    ist die Mock-Implementierung nur f&uuml;r den Betrieb mit <b>einem</b> Anwender
    bzw. einer Session konzipiert. Es k&ouml;nnen sicht also nicht mehere Anwender
    gleichzeitg am System anmelden!
</p>

<h4>LogService</h4>
<p>
Auch f&uuml;r den LogService enth&auml;lt der DevServer eine einfache Mock-Implementierung.
Diese schreibt alle Logs &uuml;ber das <a href="">Log4j-Framework</a> auf die
Standard-Ausgabe. Dies l&auml;sst sich &uuml;ber die Log4j-Konfiguration des
DevServers allerdings &auml;ndern. Der Name des Loggers lautet <code>org.prot.appserver.services.log</code>,
die Log4j-Konfigurationsdatei befindet sich unter <code>/conf/appserver/etc/log4j.xml</code>.
</p>